In [11]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
import seaborn as sns
import matplotlib.pyplot as plt
from scipy import stats
from scipy.stats import mstats

In [4]:
data = pd.read_csv('athlete_events.csv')

In [5]:
print(data.columns)

#4. print out the first 5 rows of the data to take a look the data
print(data.head())

Index(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'],
      dtype='object')
   ID                      Name Sex   Age  Height  Weight            Team  \
0   1                 A Dijiang   M  24.0   180.0    80.0           China
1   2                  A Lamusi   M  23.0   170.0    60.0           China
2   3       Gunnar Nielsen Aaby   M  24.0     NaN     NaN         Denmark
3   4      Edgar Lindenau Aabye   M  34.0     NaN     NaN  Denmark/Sweden
4   5  Christine Jacoba Aaftink   F  21.0   185.0    82.0     Netherlands

   NOC        Games  Year  Season       City          Sport  \
0  CHN  1992 Summer  1992  Summer  Barcelona     Basketball
1  CHN  2012 Summer  2012  Summer     London           Judo
2  DEN  1920 Summer  1920  Summer  Antwerpen       Football
3  DEN  1900 Summer  1900  Summer      Paris     Tug-Of-War
4  NED  1988 Winter  1988  Winter    Calgary  Speed Skating

                              Event Medal
0       Basketball Men's Basketball   NaN
1      Judo Men's Extra-Lightweight   NaN
2           Football Men's Football   NaN
3       Tug-Of-War Men's Tug-Of-War  Gold
4  Speed Skating Women's 500 metres   NaN

In [6]:
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [7]:
def percent_null(df):
    return df.isnull().sum()*100/len(df)

In [8]:
percent_null(data)

ID         0.000000
Name       0.000000
Sex        0.000000
Age        3.494445
Height    22.193821
Weight    23.191180
Team       0.000000
NOC        0.000000
Games      0.000000
Year       0.000000
Season     0.000000
City       0.000000
Sport      0.000000
Event      0.000000
Medal     85.326207
dtype: float64

In [15]:
numeric_cols = data.select_dtypes(include=[np.number])
cat_cols = data.select_dtypes(include=[np.object])

In [16]:
percent_null(numeric_cols)

ID         0.000000
Age        3.494445
Height    22.193821
Weight    23.191180
Year       0.000000
dtype: float64

In [17]:
percent_null(cat_cols)

Name       0.000000
Sex        0.000000
Team       0.000000
NOC        0.000000
Games      0.000000
Season     0.000000
City       0.000000
Sport      0.000000
Event      0.000000
Medal     85.326207
dtype: float64

In [18]:
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer

In [19]:
imp_mean = SimpleImputer(strategy='mean')

In [20]:
data_imp_mean = imp_mean.fit_transform(numeric_cols)

In [21]:
data_imp_mean = pd.DataFrame(data_imp_mean,columns = numeric_cols.columns)

In [29]:
percent_null(numeric_cols)

ID         0.000000
Age        3.494445
Height    22.193821
Weight    23.191180
Year       0.000000
dtype: float64

In [27]:
numeric_cols.describe()

,ID,Age,Height,Weight,Year
count,271116.000000,261642.000000,210945.000000,208241.000000,271116.000000
mean,68248.954396,25.556898,175.338970,70.702393,1978.378480
std,39022.286345,6.393561,10.518462,14.348020,29.877632
min,1.000000,10.000000,127.000000,25.000000,1896.000000
25%,34643.000000,21.000000,168.000000,60.000000,1960.000000
50%,68205.000000,24.000000,175.000000,70.000000,1988.000000
75%,102097.250000,28.000000,183.000000,79.000000,2002.000000
max,135571.000000,97.000000,226.000000,214.000000,2016.000000

In [28]:
data_imp_mean.describe()

,ID,Age,Height,Weight,Year
count,271116.000000,271116.000000,271116.00000,271116.000000,271116.000000
mean,68248.954396,25.556898,175.33897,70.702393,1978.378480
std,39022.286345,6.280857,9.27810,12.574690,29.877632
min,1.000000,10.000000,127.00000,25.000000,1896.000000
25%,34643.000000,22.000000,170.00000,63.000000,1960.000000
50%,68205.000000,25.000000,175.33897,70.702393,1988.000000
75%,102097.250000,28.000000,180.00000,75.000000,2002.000000
max,135571.000000,97.000000,226.00000,214.000000,2016.000000

In [30]:
imp_iter = IterativeImputer(max_iter=5,sample_posterior=True,random_state=122)

In [31]:
data_imp_iter = imp_iter.fit_transform(numeric_cols)

In [32]:
data_imp_iter = pd.DataFrame(data_imp_iter,columns = numeric_cols.columns,index=data.index)

In [33]:
data_imp_iter.head()

    ID   Age      Height     Weight    Year
0  1.0  24.0  180.000000  80.000000  1992.0
1  2.0  23.0  170.000000  60.000000  2012.0
2  3.0  24.0  184.153455  96.065758  1920.0
3  4.0  34.0  176.608324  74.595056  1900.0
4  5.0  21.0  185.000000  82.000000  1988.0

#### Data outliers and scaling

In [45]:
idx = (np.abs(stats.zscore(data_imp_iter)) < 3).all(axis=1)

In [56]:
mstats.winsorize(data_imp_iter['Age'],limits=[0.05,0.05])

masked_array(data=[24., 23., 24., ..., 27., 30., 34.],
             mask=False,
       fill_value=1e+20)

In [57]:
from sklearn.preprocessing import StandardScaler